package secondOpenClose.instance2;

/**
 *  ПРИНЦИП - модулии и классы в них должны быть закрыты для изменений,но открыты для расширения.
 *  В программу всегдя должна быть возможность внесения доаполнения, на случчай изменения требований заказчика.
 *  В этом случае мы не меняем весь код, а дописываем новые классы и новые методы,
 *  НЕ ЗАТРАГИВАЮЩИЕ СТАРЫЙ РАБОТОСПоСОБНЫЙ КОД.
 *  Во всей программе связь между модулями должна осуществляться с помощью интерфейсов или АБстрактных КЛАССОВ-
 *  что позволяет потом внедрить дополнительные классы
 */
abstract class AreaFormula {

    public abstract double calculationArea();
}
