package secondOpenClose.instance1;


/**
 *  ПРИНЦИП - модулии и классы в них должны быть закрыты для изменений,но открыты для расширения.
 *  В программу всегдя должна быть возможность внесения доаполнения, на случчай изменения требований заказчика.
 *  В этом случае мы не меняем весь код, а дописываем новые классы и новые методы,
 *  НЕ ЗАТРАГИВАЮЩИЕ СТАРЫЙ РАБОТОСПоСОБНЫЙ КОД.
 *  Во всей программе связь между модулями должна осуществляться с помощью интерфейсов -
 *  что позволяет потом внедрить дополнительные классы
 *
 */
public class LoanApproveValidator {

    //здесь мы в арументы метода подставляем Интерфейс, что дает нам возможность вызывать методы Классов
    // имплементятящих данный И.

    public void almostValidate(Validator validator){

       if (validator.valid()){

        }
       validator.eat();

    }

}
